Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/colleges_and_qualifications/third_level_qualifications.html.txt.tmx
Source language: en
Languages: ga

source: Further and higher education qualifications
ga: Cáilíochtaí ardoideachais agus oideachais leanúnaigh

source: Different bodies are entitled to award or validate qualifications in the further and higher education sectors
ga: Faoi láthair tá réimse eagraíochtaí atá údaraithe le cáilíochtaí in oideachas leanúnach nó ardoideachas a bhronnadh nó aitheantas a thabhairt do na cáilíochtaí sin

source: Further education and training is education and training between post-primary level and higher education
ga: Oideachas agus traenáil idir an leibhéal iarbhunoideachais agus ardoideachas é an t-oideachas agus traenáil leanúnach

source: Higher education and training is provided mainly in universities and colleges of technology or equivalent bodies
ga: Na hollscoileanna, na coláistí teicneolaíochta nó eagraíochtaí den chineál sin a chuireann ardoideachas agus traenáil ar fáil don chuid is mó

source: • Universities:The State-supported universities all award their own degrees and other awards
ga: • Ollscoileanna: Bronnann na hollscoileanna ar fad atá ann faoi láthair agus a fhaigheann maoiniú Stáit a gcuid céimeanna agus cáilíochtaí féin

source: • Institutes of technology: The Dublin Institute of Technology also makes its own awards
ga: • Na hInstitiúidí Teicneolaíochta: Bronnann Institiúid Teicneolaíochta Bhaile Átha Cliath a cuid cáilíochtaí féin freisin

source: The other institutes of technology grant degrees, diplomas and certificates which are validated by Quality and Qualifications Ireland
ga: Déanann na hinstitiúidí teicneolaíochta eile céimeanna, dioplómaí agus teastais a dheonú a dhéanann Dearbhú Cáilíochta agus Cáilíochtaí Éireann a bhailíochtú

source: • Other colleges: The other State-supported colleges generally grant awards that are validated by Quality and Qualifications Ireland
ga: • Coláistí eile: Is gnách go ndeonaíonn na coláistí eile faoi thacaíocht an Stáit dámhachtainí a bhronnann Dearbhú Cáilíochta agus Cáilíochtaí Éireann a bhailíochtú

source: • Private colleges: The private colleges make awards, some of which are validated by foreign universities and some of which are validated by Quality and Qualifications Ireland
ga: • Coláistí Príobháideacha: Bronnann na coláistí príobháideacha dámhachtainí, agus déanann ollscoileanna iasachta cuid díobh a bhailíochtú agus déanann Dearbhú Cáilíochta agus Cáilíochtaí Éireann cuid eile díobh a bhailíochtú

source: Some of their awards are not validated by any outside body
ga: Níl aon aitheantas ag cuid dá gcáilíochtaí ó aon eagraíocht seachtrach

source: Quality and Qualifications Ireland
ga: Dearbhú Cáilíochta agus Cáilíochtaí Éireann

source: Quality and Qualifications Ireland (QQI) was established on 6 November 2012 under the Qualifications and Quality Assurance (Education and Training) Act 2012
ga: Bunaíodh Dearbhú Cáilíochta agus Cáilíochtaí Éireann (QQI) an 6 Samhain 2012 faoin Acht um Cháilíochtaí agus Dearbhú Cáilíochta (Oideachas agus Oiliúint), 2012

source: It has taken over the functions of the following 4 bodies:
ga: Ghlac siad ceannas ar fheidhmeanna na gceithre chomhlacht a leanas:

source: • National Qualifications Authority of Ireland (NQAI)
ga: • Údarás Náisiúnta Cáilíochtaí na hÉireann (NQAI)

source: • Further Education and Training Awards Council (FETAC)
ga: • Comhairle na nDámhachtainí Breisoideachais agus Oiliúna (FETAC)

source: • Higher Education and Training Awards Council (HETAC)
ga: • Comhairle na nDámhachtainí Ardoideachais agus Oiliúna (HETAC)

source: • Irish Universities Quality Board (IUQB)
ga: • Bord Cáilíochta Ollscoileanna na hÉireann (IUQB)

source: The NQAI was, among other things, responsible for establishing and maintaining the National Framework of Qualifications, establishing procedures for the councils and deciding on procedures to be implemented by the education providers in relation to access, transfer and progression
ga: Bhí an NQAI, i measc rudaí eile, freagrach as an gCreat Náisiúnta Cáilíochtaí a bhunú agus a choimeád, nósanna imeachta a bhunú do na comhairlí agus cinneadh a dhéanamh ar nósanna imeachta atá le cur i bhfeidhm ag soláthróirí oideachais maidir le rochtain, aistriú agus dul chun cinn

source: The Qualifications Recognition service at the NQAI included the recognition of foreign qualifications and the International Qualifications Database
ga: I measc na seirbhíse um Aitheantas Cáilíochtaí ag an NQAI, bhí aitheantas cáilíochtaí iasachta agus an Bunachar Sonraí Cáilíochtaí Idirnáisiúnta

source: The IUQB was responsible for quality assurance in the Irish university sector
ga: Bhí an IUQB freagrach as dearbhú cáilíochta in earnáil ollscoileanna na hÉireann

source: It conducted regular external reviews of quality procedures in Irish universities
ga: Thug siad faoi athbhreithnithe rialta seachtracha ar nósanna imeachta cáilíochta in ollscoileanna na hÉireann

source: The two awarding bodies - the Further Education and Training Awards Council (FETAC) and the Higher Education and Training Awards Council (HETAC) - were the certification bodies for all of the education and training in the State other than that in primary and post-primary education and in the universities and the Dublin Institute of Technology
ga: Ba iad an dá chomhlacht bronnta – Comhairle na nDámhachtainí Breisoideachais (FETAC) agus Comhairle na nDámhachtainí Ardoideachais (HETAC) – na comhlachtaí deimhnithe don oideachas agus don oiliúint go léir sa Stát, seachas é sin in oideachas na mbunscoileanna agus na meánscoileanna agus sna hollscoileanna agus in Institiúid Teicneolaíochta Bhaile Átha Cliath

source: HETAC could delegate authority to institutes of technology to make higher education and training awards
ga: D’fhéadfadh HETAC údarás a thairmligean d’institiúidí teicneolaíochta chun dámhachtainí ardoideachais agus oiliúna a bhronnadh

source: There was a similar facility within FETAC
ga: Bhí a shamhail de shaoráid ann laistigh de FETAC

source: The principal functions of FETAC and HETAC were:
ga: Ba iad príomhfheidhmeanna FETAC agus HETAC:

source: • The establishment of policies and criteria for the making of awards
ga: • Beartais agus critéir a bhunú chun dámhachtainí a bhronnadh

source: • The validation of programmes in further or higher education and training
ga: • Bailíochtú clár sa bhreisoideachas nó san ardoideachas agus oiliúint

source: • The setting of standards of knowledge, skill or competence which must be acquired by learners, before an award may be made
ga: • Caighdeáin eolais, scileanna nó inniúlachta a leagan amach nach mór d’fhoghlaimeoirí a bhaint amach, sular féidir dámhachtain a bhronnadh orthu

source: Awards and qualifications formerly made by FETAC and HETAC continue to be recognised, because they are on the National Framework of Qualifications
ga: Leantar le dámhachtainí agus cáilíochtaí a bhronn FETAC agus HETAC roimhe seo a aithint, mar gheall go bhfuil siad luaite ar an gCreat Náisiúnta Cáilíochtaí

source: If you are enrolled on a programme leading to a FETAC or HETAC award, your award will now be made by Quality and Qualifications Ireland
ga: Má tá tú cláraithe ar chlár as a n-eascróidh dámhachtain FETAC nó HETAC, déanfaidh Dearbhú Cáilíochta agus Cáilíochtaí Éireann do dhámhachtain a bhronnadh ort

source: All providers of education and training need to inform learners of the transfer and progression routes that are available for them if they undertake a particular course
ga: Déanfar na bealaí aistrithe agus dul chun cinn iad féin a shruthchúrsáil agus a chomhordú sa chaoi go mbeidh sé níos éasca ag foghlaimeoirí leas a bhaint as na leibhéil eagsúla cáilíochtaí

source: Validation of individual learning
ga: Aitheantas don fhoghlaim aonair

source: Individual learners may also approach QQI directly to seek certification or recognition for their existing knowledge, skill or competence
ga: Is féidir le foghlaimeoirí aonair freisin dul chuig na comhairlí cáilíochtaí go díreach le teistiméireacht nó aitheantas a lorg don eolas, scileanna nó inniúlacht atá acu

source: It will be a matter for QQI to decide how this prior learning and prior experience can be assessed and they may look for help and advice from the providers of education and training in making this assessment
ga: Beidh sé suas ag na comhairlí cáilíochtaí iad féin cinneadh a dhéanamh cén chaoi a ndéanfar measúnacht ar an bhfoghlaim agus ar an taithí atá ag duine cheana agus d'fhéadfadh sé go mbeadh cúnamh agus comhairle dhá lorg acu ó sholáthraithe oideachais agus traenála leis an mheasúnacht sin a dhéanamh

source: There are specific provisions for the protection of learners where a provider operates programmes of education and training on a commercial and profit-making basis
ga: Tá soláthar faoi leith ann le foghlaimeoirí a chosaint nuair atá soláthraí ag cur cúrsaí oideachais agus traenála ar fáil ar bhonn tráchtála agus le brabús a dhéanamh

source: Such programmes will not be recognised by QQI unless there are provisions in place to ensure that the provider can provide an alternative place in another institution, or has a reserve fund or is adequately insured
ga: Ní bheidh aitheantas ó na comhairlí cáilíochtaí ag na cúrsaí sin muna bhfuil soláthar ann le cinntiú gur féidir leis an solráthraí áit eile a chur ar fáil in institiúid eile, nó go bhfuil cúlchiste ann nó árachas cuí aige. Cá hait a ndéanfaidh mé iarratas?
